Revit 2027 API
PathReinforcement.RemovePathReinforcementSystem Method
 Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> RemovePathReinforcementSystem(
	Document doc,
	PathReinforcement system
)
Public Shared Function RemovePathReinforcementSystem (
	doc As Document,
	system As PathReinforcement
) As IList(Of ElementId)
public:
static IList<ElementId^>^ RemovePathReinforcementSystem(
	Document^ doc,
	PathReinforcement^ system
)
static member RemovePathReinforcementSystem :
        doc : Document *
        system : PathReinforcement -> IList<ElementId>
Parameters
doc Document
 The document.
system PathReinforcement
 A PathReinforcement element in the document.
Return Value
IList<ElementId>
 The ids of the newly created Rebar elements.
Exceptions
Exception | Condition
ArgumentException |  The element system was not found in the given document. -or- system does not host Rebar.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace